Documents/СписокПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>СписокПродаж</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АптечныйПункт_Потрибитель</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыПродаж</xr:Item>
				<xr:Item>AccumulationRegister.РегистрПрибыли</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВладельцыКлубныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АптечныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокОтделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Корзина</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СписокПродаж/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КорзинаКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Корзина.ТекущиеДанные;
	Отделение=Строка(Объект.АптечныйПункт);
	ФункцииДляРаботыСДокументами.РассчитатьСуммуПродажа(СтрокаТабличнойЧасти,Отделение);
КонецПроцедуры

&НаКлиенте
Процедура КорзинаЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Корзина.ТекущиеДанные;
	Отделение=Строка(Объект.АптечныйПункт);
	ФункцииДляРаботыСДокументами.РассчитатьСуммуПродажа(СтрокаТабличнойЧасти,Отделение);
КонецПроцедуры

&НаКлиенте
Процедура КорзинаТоварПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Корзина.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена=СерверныеФункции.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Товар);
	ФункцииДляРаботыСДокументами.РассчитатьСуммуПродажа(СтрокаТабличнойЧасти);	
КонецПроцедуры
